conf/DataProcessors/СписокИнформационныхБаз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>СписокИнформационныхБаз</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

conf/Enums/ТипыИнформационныхБаз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыИнформационныхБаз</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Файловая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Серверная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСерверная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

conf/DataProcessors/СписокИнформационныхБаз/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьПредприятие(Команда)
	Если Элементы.СписокИБ.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Описание = ОписаниеЗапускаемойИБ(Элементы.СписокИБ.ТекущаяСтрока);
	
	Если Описание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Описание.ЭтоФайловая Тогда
		ИнформационныеБазыКлиент.ОткрытьПредприятиеФайловойБазы(Описание.ОписаниеИБ);
		
	ИначеЕсли Описание.ЭтоСерверная Тогда
		ИнформационныеБазыКлиент.ОткрытьПредприятиеСервернойБазы(Описание.ОписаниеИБ);
		
	ИначеЕсли Описание.ЭтоВебСерверная Тогда
		ИнформационныеБазыКлиент.ОткрытьПредприятиеВебСервернойБазы(Описание.ОписаниеИБ);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКонфигурацию(Команда)
	Если Элементы.СписокИБ.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Описание = ОписаниеЗапускаемойИБ(Элементы.СписокИБ.ТекущаяСтрока);
	
	Если Описание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Описание.ЭтоФайловая Тогда
		ИнформационныеБазыКлиент.ОткрытьКонфигураторФайловойБазы(Описание.ОписаниеИБ);
		
	ИначеЕсли Описание.ЭтоСерверная Тогда
		ИнформационныеБазыКлиент.ОткрытьКонфигураторСервернойБазы(Описание.ОписаниеИБ);
		
	ИначеЕсли Описание.ЭтоВебСерверная Тогда
		ИнформационныеБазыКлиент.ОткрытьКонфигураторВебСервернойБазы(Описание.ОписаниеИБ);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ОписаниеЗапускаемойИБ(ИнформационнаяБаза)
	Описание = Новый Структура;
	Описание.Вставить("ЭтоФайловая", Ложь);
	Описание.Вставить("ЭтоСерверная", Ложь);
	Описание.Вставить("ЭтоВебСерверная", Ложь);
	Описание.Вставить("ОписаниеИБ");
	
	ЗапрашиваемыеДанные = Новый Структура;
	ЗапрашиваемыеДанные.Вставить("Заголовок", "Наименование");
	ЗапрашиваемыеДанные.Вставить("ЭтоФайловая", "Тип = ЗНАЧЕНИЕ(Перечисление.ТипыИнформационныхБаз.Файловая)");
	ЗапрашиваемыеДанные.Вставить("ЭтоСерверная", "Тип = ЗНАЧЕНИЕ(Перечисление.ТипыИнформационныхБаз.Серверная)");
	ЗапрашиваемыеДанные.Вставить("ЭтоВебСерверная", "Тип = ЗНАЧЕНИЕ(Перечисление.ТипыИнформационныхБаз.ВебСерверная)");
	ЗапрашиваемыеДанные.Вставить("ЗапретитьОткрыватьКонфигуратор", "ЗапретитьОткрыватьКонфигуратор");
	ЗапрашиваемыеДанные.Вставить("ПредупреждатьПередОткрытиемПредприятия", "ПредупреждатьПередОткрытиемПредприятия");
	ЗапрашиваемыеДанные.Вставить("ПутьКПапке", "ПутьКПапке");
	ЗапрашиваемыеДанные.Вставить("ИмяСервера", "ИмяСервера");
	ЗапрашиваемыеДанные.Вставить("ИмяБазыНаСервере", "ИмяБазыНаСервере");
	ЗапрашиваемыеДанные.Вставить("АдресВебСервера", "АдресВебСервера");
	ЗапрашиваемыеДанные.Вставить("ПутьКФайлуКВерсииПлатформы", "ВерсияПлатформы.ПутьКФайлу");
	ДанныеИБ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ИнформационнаяБаза, ЗапрашиваемыеДанные);
	
	Если ДанныеИБ.ЭтоФайловая Тогда
		Описание.ЭтоФайловая = Истина;
		Описание.ОписаниеИБ = ИнформационныеБазыКлиентСервер.ОписаниеЗапускаемойФайловойИБ();
		
	ИначеЕсли ДанныеИБ.ЭтоСерверная Тогда
		Описание.ЭтоСерверная = Истина;
		Описание.ОписаниеИБ = ИнформационныеБазыКлиентСервер.ОписаниеЗапускаемойСервернойИБ();
		
	ИначеЕсли ДанныеИБ.ЭтоВебСерверная Тогда
		Описание.ЭтоВебСерверная = Истина;
		Описание.ОписаниеИБ = ИнформационныеБазыКлиентСервер.ОписаниеЗапускаемойВебСервернойИБ();
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Описание.ОписаниеИБ, ДанныеИБ);
	
	Возврат Описание;
КонецФункции

#КонецОбласти
